<template>
    <div class="sticky-demo">
        <z-sticky :distance="100">
            <z-button>Hello, I'm a sticky element</z-button>
        </z-sticky>
        <p>
            《月亮和六便士》 是威廉·萨默塞特·毛姆的一本小说，以第一人称通过对中心人物查尔斯·思特里克兰德心灵的描述，展现一个中年英国股票经纪人如何突然扔下妻子和孩子去追寻成为艺术家的梦想。
            故事一说是取材于画家保罗·高更的生活。小说大部分以自述者的眼光写成，自述者最初通过思特里克兰德的妻子介绍而相识。部分章节全部是由自述者回忆的他人的故事或自述（选择性的编辑或修饰了一些对话，
            特别是思特里克兰德的，因为文中说道思特里克兰德比起口头语言更倾向用身体语言表达）。 思特里克兰德是生活在19世纪末20世纪初的伦敦的一个富裕的中产阶级股票经纪人。小说起始，他离开妻子和孩子到了巴黎，
            以艺术家（主要是画家）的身份过着贫穷却目中无人的充足的生活，夜宿于破败的酒店，疾病饥饿缠身。在始终萦绕的强迫性的艺术表达的驱动下，思特里克兰德不关心物质上的安逸，漠视身边环境的艰难，
            但在巴黎时一直接受一名商业上成功的但已过气的荷兰画家、自述者的朋友戴尔克·施特略夫的帮助。后者随即认识到思特里克兰德的天赋。
            在施特略夫帮助思特里克兰德度过一场危及生命的重病后，施特略夫的妻子布兰奇因爱上了思特里克兰德而与她的丈夫分开。思特里克兰德随后抛弃了布兰奇（所有他想要的不过是一个模特而不是一段感情，
            小说的对话中思特里克兰德提及了此事但布兰奇愿意承担风险）。随后布兰奇自杀身亡，成为又一个思特里克兰德对艺术和美的全身心的的追求中的牺牲品。

            在巴黎的故事后，故事又从塔西提岛继续。思特里克兰德已经死了，自述者试图从他人的回忆中拼凑出他在岛上的生活。他发现思特里克兰德和一名当地女子发生关系并生下两个孩子（其中一个死掉）并且创作上非常高产。
            我们得知思特里克兰德因麻风病去世前在塔西提岛度过了几年，在这之前还在法国港口马赛定居了一段时间。思特里克兰德留下了无数画作，但他的妻子根据他的遗愿在他死后将他在因麻风病失明前于他的小屋的墙上创作的杰作烧掉了。

        </p>
    </div>
</template>
<script>
    import ZSticky from '../../../src/sticky'
    import ZButton from '../../../src/button/button'
    export default {
        components: {ZSticky, ZButton},

    }

</script>
<style>
    .sticky-demo {
        margin-top: 32px;
        margin-bottom: 128px;
    }
</style>